caseStudy/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.water.*"
    {
        cAlpha          0;
        nAlphaCorr      2;
        nAlphaSubCycles 1;

        MULESCorr       yes;
        nLimiterIter    5;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
        maxIter         10;
    };

    "U.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0;
    };

    p_rgh
    {
        solver          GAMG;
        tolerance       1e-6;
        relTol          0;

        smoother        DICGaussSeidel;

    };

    p_rghFinal
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;

            tolerance       1e-6;
            relTol          0;

            nVcycles        2;

            smoother        DICGaussSeidel;

        };
        tolerance       1e-7;
        relTol          0;
        maxIter         50;
    };

    pcorr
    {
        $p_rgh;
        relTol          0;
    };

}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
    nCorrectors          1;
    nOuterCorrectors    500;
    turbOnFinalIterOnly false;
 
    residualControl
    {
        U
        {
                tolerance  1e-4;
                relTol      0;
        }
        alpha.water
        {
                tolerance  1e-6;
                relTol      0;
        }
        p_rgh
        {
                tolerance  1e-6;
                relTol      0;
        }
     }
}

relaxationFactors
{
    fields
    {
        p      0.7;
        pFinal   1;
    }
    equations
    {
        "U|k|epsilon"     0.3;
        "(U|k|epsilon)Final"   1;
    }
}
 


// ************************************************************************* //
